app/controllers/urlshorts_controller.rb

	def index
		@statid = params[:stats]
		unless @statid == nil
			 @fulllist = Urlstats.fullurlid(@statid).count
			 @groupdata = Urlstats.fullurlid(@statid).select('count(*) as total,ip').group('ip')
		else
			@urlsh = Urlshort.all
---
SELECT count(*) as total,ip FROM `urlstats`  WHERE `urlstats`.`fullurlid` = '1' GROUP BY ip
SELECT sum(*) as total,ip FROM `urlstats`  WHERE `urlstats`.`fullurlid` = '1' GROUP BY ip
SELECT `urlshorts`.* FROM `urlshorts`

	def create
		@urlshort = Urlshort.new(article_params)
  		@urlshort.save
---
INSERT INTO "urlshorts" ("created_at", "desc", "fullurl", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-25 13:46:55.057623"], ["desc", "google da"], ["fullurl", "www.google.com"], ["updated_at", "2014-06-25 13:46:55.057623"]]

	def show
  		@urlshort = Urlshort.find(params[:id])
		@test = Urlshort.find(params[:id])['fullurl']
		@remoteip = request.remote_ip
		@statsobj = Urlstats.new(:fullurlid => params[:id], :ip => request.remote_ip)
		@statsobj.save
---
SELECT  `urlshorts`.* FROM `urlshorts`  WHERE `urlshorts`.`id` = ? LIMIT 1  [["id", 1]]
INSERT INTO `urlstats` (`created_at`, `fullurlid`, `ip`, `updated_at`) VALUES (?, ?, ?, ?)  [["created_at", "2014-06-26 06:40:49"], ["fullurlid", "1"], ["ip", "127.0.0.1"], ["updated_at", "2014-06-26 06:40:49"]]